Revit 2024 API
FabricationPartBrowserOperation Enumeration
 Operations for the FabricationPartBrowserChangedEventArgs Event
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum FabricationPartBrowserOperation
Visual Basic
Public Enumeration FabricationPartBrowserOperation
Visual C++
public enum class FabricationPartBrowserOperation
Members
Member name | Description
UnknownOperation |  Unknown operation
ShowBrowser |  Show browser window
HideBrowser |  Hide browser window
ShowService |  Select current service
StartRoutingSolutionMode |  Start routing solution mode
CreatedRoutingSolutions |  Routing solutions (re)created
RoutingSolutionChanged |  Active Routing solution has changed
FinishRoutingSolutionMode |  Finish routing solution mode
StartMPRoutingMode |  Start multi-point routing mode
FinishMPRoutingMode |  Finish multi-point routing mode
StartServiceSwapOutMode |  Start service swap-out mode
FinishServiceSwapOutMode |  Finish service swap-out mode
UpdateServiceSwapOutPartTypes |  Service swap out part type mappings has changed.
UpdateServiceSwapOutSizes |  Service swap out size mappings has changed.
StartSizeSwapOutMode |  Start size swap-out mode.
FinishSizeSwapOutMode |  Finish size swap out mode.
SwitchToInlineFittingsTab |  Make the inline fittings tab active in Change Service.
See Also
Autodesk.Revit.UI.Events Namespace